---
kind: property
id: P:Autodesk.Revit.DB.OverrideGraphicSettings.CutForegroundPatternColor
source: html/7408f78d-480e-0afa-ba6b-33197504b894.htm
---
# Autodesk.Revit.DB.OverrideGraphicSettings.CutForegroundPatternColor Property

The override color of the foreground pattern of cut faces.

## Syntax (C#)
```csharp
public Color CutForegroundPatternColor { get; }
```